# Арифметические операции
# + сложение двух чисел
print(6 + 2)  # 8
# Вычитание двух чисел:
print(6 - 2)  # 4
# * Умножение двух чисел:
print(6 * 2)  # 12
# / Деление двух чисел:
print(6 / 2)  # 3.0
# // Целочисленное деление двух чисел:
print(7 / 2)  # 3.5
print(7 // 2)  # 3
# ** Возведение в степень:
print(6 ** 2)  # Возводим число 6 в степень 2. Результат - 36
# % Получение остатка от деления:
print(7 % 2)  # Получение остатка от деления числа 7 на 2. Результат - 1

# Арифметические операции с присвоением
# += Присвоение результата сложения
# -= Присвоение результата вычитания
# *= Присвоение результата умножения
# /= Присвоение результата от деления
number = 10
number += 5
print(number)  # 15

number -= 3
print(number)  # 12

number *= 4
print(number)  # 48


# Конкатенация - склеивание строк
word_1 = 'Hello!'
word_2 = 'How are you?'
print(word_1 + word_2)  # Hello!How are you?
